{"symptom": "If users have 430-8e/430-16e or 930-8e SAS HBA cards installed in the system and connected to DE series storage systems, after upgrading XCC to versions later than v2.10, users will see an alert THE EXT DRIVE HAS BEEN DISABLED DUE TO A DETECTED FAULT when the system runs in normal operation. XCC versions v2.10 (CDI328M) and prior have no such problem. (where SAS = Serial Attached SCSI, XCC = Lenovo XClarity Controller)", "affected_configurations": ["The system may be any of the following Lenovo servers:", "ThinkSystem SR530, Type 7X07, any model\nThinkSystem SR530, Type 7X08, any model\nThinkSystem SR550, Type 7X03, any model\nThinkSystem SR550, Type 7X04, any model\nThinkSystem SR570, Type 7Y02, any model\nThinkSystem SR570, Type 7Y03, any model\nThinkSystem SR590, Type 7X98, any model\nThinkSystem SR590, Type 7X99, any model\nThinkSystem SR630, Type 7X01, any model\nThinkSystem SR630, Type 7X02, any model\nThinkSystem SR650, Type 7X05, any model\nThinkSystem SR650, Type 7X06, any model\nThinkSystem ST550, Type 7X09, any model 7X09, 7X10\nThinkSystem ST550, Type 7X10, any model\n", "This tip is not software specific.", "This tip is not option specific.", "The system has the symptom described above."], "solution": "This behavior will be corrected in a future release of XCC. The target date for this release is scheduled for Forth Quarter 2019. The file is or will be available by selecting the appropriate Product Group, type of System, Product name, Product machine type, and Operating system on Lenovo Support web page, at the following URL: http://datacentersupport.lenovo.com/", "workaround": "1. Power off the system. 2. Change the volume LUN ID to start from ID 0 on the DE series storage system. For example, if users have LUN IDs from 1 to 8, then they can change 8 to 0, so the LUN IDs will be from 0 to 7. 3. Power on the system. Wait for a few minutes after reboot, users will see the event The Ext Drive has been enabled. Note: There is an Access volume assigned to the host by default with LUN ID 7 for the storage in-band management purpose. The Access volume does not consume any storage capacity. However, the volume exists as a logical entity for processing of in-band management commands and for host discovery. The Access volume is not displayed in the volume page on the web GUI but does appear on the Host Mapping tab. The LUN ID of Access volume cannot be modified but can be un-assigned if the customer does not need the in-band management. However, the Access volume cannot be reassigned to the host once it is un-assigned. The only way to reactivate the in-band management from a host is to delete the host from the Hosts page and recreate the host again.", "additional_information": "XCC uses the latest Broadcom Storlib Library to communicate with Broadcom RAID/HBA controllers. The previous XCC release was not able to get enclosure and drive info for ThinkSystem DE4000H. From XCC versions later than v2.10, because of the new Storlib library, XCC is able to get drive info of ThinkSystem DE4000H without enclosure info. However, the drive info read through HBA 430-8e is virtual disk info instead of physical drive info. The drive information is incorrect, which ultimately triggers the false alert.", "title": "HBA 430/930-XE reports \"THE EXT DRIVE HAS BEEN DISABLED DUE TO A DETECTED FAULT\" after upgrading XCC - Lenovo ThinkSystem", "publish_date": "2019-12-05", "tip_number": "tips\\HT508901", "cogent_draft": "101001", "file": "./tips\\HT508901", "level": "Unclassified", "tip_type": "", "affected_types": ["7X07", "7X08", "7X03", "7X04", "7Y02", "7Y03", "7X98", "7X99", "7X01", "7X02", "7X05", "7X06", "7X09", "7X10"]}
